app/controllers/products_controller.rb

  def buy
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "in_store", "created_at", "updated_at", "weight", "date_available", "color") VALUES('Maslo', 20, 't', '2009-03-05 16:47:42', '2009-03-05 16:47:42', 125, '2009-03-05', 'zelena')