app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "password") VALUES('tom', '2009-03-05 17:40:55', '2009-03-05 17:40:55', 'tom')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save